[
  {
    "id": 0,
    "title": "Bookish brief",
    "visit": "",
    "github": "https://github.com/ahmed-abdulhuy/bookish_brief",
    "brief": "A ReactJS and Redux-based Web app that you could use to store notes about books. The website is created with Express and MySQL databases for the back end. The app's main functionalities of it are List all books with brief descriptions and book information and Filter books based on category."
  },

  {
    "id": 1,
    "title": "Meetings",
    "visit": "https://elgarash.github.io/meetings/",
    "github": "https://github.com/ElGarash/meetings",
    "brief": "A serverless meetings web app with a dashboard. The website is hosted on GitHub Pages. It uses JITSI IFrame API to set the meetings. The possible functionalities of the website are Start meetings and manage contemporary meeting rooms, Send meeting participants and label data to the database using the Azure function API, and Stream the meeting on YouTube."
  },

  {
    "id": 2,
    "title": "Leveraging cross-view geo-localization with ensemble learning and temporal awareness",
    "visit": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0283672",
    "github": "",
    "brief": "In this paper, it is shown that previous models in this area are complementary, not competitive, and that each model solves a different aspect of the problem. There was a need for a holistic approach. An ensemble model is proposed to aggregate the predictions of multiple independently trained state-of-the-art models. Previous state-of-the-art (SOTA) temporal-aware models used heavy-weight network to fuse the temporal information into the query process. The effect of making the query process temporal-aware is explored and exploited by an efficient meta block: naive history. But none of the existing benchmark datasets was suitable for extensive temporal awareness experiments, a new derivative dataset based on the BDD100K dataset is generated. The proposed ensemble model achieves a recall accuracy R@1 (Recall@1: the top most prediction) of 97.74% on the CVUSA dataset and 91.43% on the CVACT dataset (surpassing the current SOTA). The temporal awareness algorithm converges to R@1 of 100% by looking at a few steps back in the trip history."
  }
]
